rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    pm_handler_on_pm_evt(p_evt);
    pm_handler_flash_clean(p_evt);

    switch (p_evt->evt_id)
    {
        case PM_EVT_PEERS_DELETE_SUCCEEDED:
            advertising_start(false);
            break;

        default:
            break;
    }
}

/**@brief Function for the LSM9DS1 initialization.
 *
 * @details Initializes the LSM9DS1 accelerometer, gyroscope and magnetometer
 */
static void lsm9ds1_init(void)
{
    //initialize read/write methods for acc./gyro.
    lsm9ds1_imu.read_reg = read_imu;
    lsm9ds1_imu.write_reg = write_imu;

    //initialize read/write methods for mag.
    lsm9ds1_mag.read_reg = read_mag;
    lsm9ds1_mag.write_reg = write_mag;

    //configure the power pin and pullup resistor pins for the LSM9DS1
    nrf_gpio_cfg_output(BLE_33_PULLUP); //send power to BLE 33 Sense pullup resistors (they aren't connected to VDD)
    nrf_gpio_cfg(BLE_33_SENSOR_POWER_PIN, NRF_GPIO_PIN_DIR_OUTPUT, NRF_GPIO_PIN_INPUT_CONNECT, NRF_GPIO_PIN_NOPULL, NRF_GPIO_PIN_S0H1, NRF_GPIO_PIN_NOSENSE);
    
    //the main initialization is complete, but first attempt to communicate 
    //with the sensor just to ensure that it's there and working properly.
    nrf_gpio_pin_set(BLE_33_PULLUP);    //send power to BLE 33 Sense pullup resistors (they aren't connected to VDD)
    nrf_gpio_pin_set(BLE_33_SENSOR_POWER_PIN);
    nrf_delay_ms(50); //slight delay so the chip has time to power on

    //attempt to read the WHOAMI register
    uint32_t ret = lsm9ds1_dev_id_get(&lsm9ds1_mag, &lsm9ds1_imu, &whoamI);
    if (whoamI.imu == LSM9DS1_IMU_ID) SEGGER_RTT_WriteString(0, "LSM9DS1 discovered.\n");
    else SEGGER_RTT_WriteString(0, "Error: Couldn't find LSM9DS1.\n");

    //regardless of whether or not the LSM9DS1 is found, disable the power pins and TWI bus
    nrf_gpio_pin_clear(BLE_33_PULLUP);
    nrf_gpio_pin_clear(BLE_33_SENSOR_POWER_PIN);
    nrf_drv_twi_disable(&m_twi);

    //after shutting the TWI bus and sensor pins down, we populate the sensor settings array
    //with default values that we want the sensor to have
    sensor_settings[1] = LSM9DS1_4g;      //accelerometer full scale range (+/- 4 g)
    sensor_settings[2] = LSM9DS1_2000dps; //gyroscope full scale range (+/- 2000 degrees/s)
    sensor_settings[3] = LSM9DS1_4Ga;     //magnetometer full scale range (+/- 4 Gauss)

    sensor_settings[4] = LSM9DS1_IMU_59Hz5; //accelerometer/gyroscope ODR and Power (59.5 Hz, gyroscope in standard power mode)
    sensor_settings[5] = LSM9DS1_MAG_LP_40Hz; //magnetomer ODR and Power (40 Hz, magnetometer in low power mode)

    sensor_settings[6] = LSM9DS1_LPF1_OUT; //Gyroscope filter selection (low pass filter 1 only)
    sensor_settings[7] = 0; //gyroscope low pass filter setting (only takes effect when LPF2 is set in gyro filter path)
    sensor_settings[8] = 0; //gyroscope high pass filter setting (only takes effect when HPF is set in gyro filter path)
    sensor_settings[9] = LSM9DS1_LP_OUT; //accelerometer filter selection (low pass filter only)
    sensor_settings[10] = LSM9DS1_LP_DISABLE; //accelerometer low pass filter setting (frequency is automatically tied to ODR)
    sensor_settings[11] = 0; //accelerometer high pass filter setting (only takes effect when HP_OUT is set for accelerometer)
    sensor_settings[12] = LSM9DS1_AUTO; //accelerometer anti-aliasing bandwidth (automatically set based on current ODR)

    //The rest of the settings are blank for now
    for (int i = 13; i , 20; i++) sensor_settings[i] = 0;
}

static void lsm9ds1_sleep_mode_enable()
{
    //set the power to sleep for both acc/gyr and mag sensors
    int32_t ret = 0;
    ret = lsm9ds1_imu_data_rate_set(&lsm9ds1_imu, LSM9DS1_IMU_OFF);
    ret = lsm9ds1_mag_data_rate_set(&lsm9ds1_mag, LSM9DS1_MAG_POWER_DOWN);

    ////set the full scale ranges
    //ret = lsm9ds1_gy_full_scale_set(&lsm9ds1_imu, LSM9DS1_2000dps); // +/-2000 deg/s
    //ret = lsm9ds1_xl_full_scale_set(&lsm9ds1_imu, LSM9DS1_4g);      // +/- 4 g
    //ret = lsm9ds1_mag_full_scale_set(&lsm9ds1_mag, LSM9DS1_4Ga);    // +/- 4 gauss
}

static void characteristic_update_and_notify()
{
    
    ble_gatts_hvx_params_t acc_notify_params, gyr_notify_params, mag_notify_params;
    memset(&acc_notify_params, 0, sizeof(acc_notify_params));
    memset(&gyr_notify_params, 0, sizeof(gyr_notify_params));
    memset(&mag_notify_params, 0, sizeof(mag_notify_params));

    uint16_t data_characteristic_size = SENSOR_SAMPLES * SAMPLE_SIZE; //not really sure why the size needs to be passed in as a reference

    //Setup accelerometer notification first
    acc_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    acc_notify_params.handle = m_ss.data_handles[0].value_handle;
    acc_notify_params.p_data = acc_characteristic_data;
    acc_notify_params.p_len  = &data_characteristic_size;
    acc_notify_params.offset = 0;

    //Setup gyroscope notification second
    gyr_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    gyr_notify_params.handle = m_ss.data_handles[1].value_handle;
    gyr_notify_params.p_data = gyr_characteristic_data;
    gyr_notify_params.p_len  = &data_characteristic_size;
    gyr_notify_params.offset = 0;

    //Setup magnetometer notification third
    mag_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    mag_notify_params.handle = m_ss.data_handles[2].value_handle;
    mag_notify_params.p_data = mag_characteristic_data;
    mag_notify_params.p_len  = &data_characteristic_size;
    mag_notify_params.offset = 0;

    sd_ble_gatts_hvx(m_conn_handle, &acc_notify_params);
    sd_ble_gatts_hvx(m_conn_handle, &gyr_notify_params);
    sd_ble_gatts_hvx(m_conn_handle, &mag_notify_params);
}

static void data_reading_timer_handler(void * p_context)
{
    //uint32_t time_stamp = nrf_drv_timer_capture(&my_timer, NRF_TIMER_CC_CHANNEL1);
    //float clock_conversion = 1.0 / 16000000.0;
    //float actual_time = time_stamp * clock_conversion;
    //SEGGER_RTT_printf(0, "TWI initiated at %u ticks of 16MHz.\n", time_stamp);

    //Everytime the data reading timer goes off we take sensor readings and then 
    //update the appropriate characteristic values.
    int measurements_taken = 0;
    while (measurements_taken < SENSOR_SAMPLES)
    {
        get_IMU_data(SAMPLE_SIZE * measurements_taken);
        get_MAG_data(SAMPLE_SIZE * measurements_taken);
        measurements_taken++;
    }

    //after the samples are read, update the characteristics and notify
    characteristic_update_and_notify();
}

static void led_timer_handler(void * p_context)
{
    //This timer causes the currently active LED to light up. A separate timer is used to 
    //turn the LED back off after a set time period
    nrf_gpio_pin_clear(active_led);
    nrf_drv_timer_clear(&LED_ON_TIMER); //reset the LED-on timer
    nrf_drv_timer_enable(&LED_ON_TIMER); //turn on the LED_on timer, the handler for this timer will turn the LED back off
    //uint32_t timer_val = nrf_drv_timer_capture(&LED_ON_TIMER, NRF_TIMER_CC_CHANNEL1);
}

void led_on_timer_handler(nrf_timer_event_t event_type, void* p_context)
{
    //This handler gets called when an LED is turned to the active state. Simply turn the 
    //LED back off when this handler is called and then turn the LED-on timer off.
    nrf_gpio_pin_set(active_led);
    nrf_drv_timer_disable(&LED_ON_TIMER);

    //int32_t ret = 0;
    //SEGGER_RTT_WriteString(0, "Timer went off.\n");
    //if (current_sensor_mode % 4 == 0)
    //{
    //    //magnetometer at low power and 40 Hz b
    //    ret = lsm9ds1_mag_data_rate_set(&lsm9ds1_mag, LSM9DS1_MAG_LP_1000Hz);

    //    //blink all 3 leds
    //    nrf_gpio_pin_toggle(BLE_33_RED_LED);
    //    nrf_gpio_pin_toggle(BLE_33_BLUE_LED);
    //    nrf_gpio_pin_toggle(BLE_33_DARK_GREEN_LED);
    //    nrf_delay_ms(25);
    //    nrf_gpio_pin_toggle(BLE_33_RED_LED);
    //    nrf_gpio_pin_toggle(BLE_33_BLUE_LED);
    //    nrf_gpio_pin_toggle(BLE_33_DARK_GREEN_LED);
    //}
    //else if (current_sensor_mode % 4 == 1)
    //{
    //    //magnetometer at medium power and 40 Hz
    //    ret = lsm9ds1_mag_data_rate_set(&lsm9ds1_mag, LSM9DS1_MAG_MP_560Hz);

    //    //blink the red LED
    //    nrf_gpio_pin_toggle(BLE_33_RED_LED);
    //    nrf_delay_ms(25);
    //    nrf_gpio_pin_toggle(BLE_33_RED_LED);
    //}
    //else if (current_sensor_mode % 4 == 2)
    //{
    //    //magnetometer at high power and 40 Hz
    //    ret = lsm9ds1_mag_data_rate_set(&lsm9ds1_mag, LSM9DS1_MAG_HP_300Hz);

