rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
    //    //blink the green LED
    //    nrf_gpio_pin_toggle(BLE_33_DARK_GREEN_LED);
    //    nrf_delay_ms(25);
    //    nrf_gpio_pin_toggle(BLE_33_DARK_GREEN_LED);
    //}
    //else if (current_sensor_mode % 4 == 3)
    //{
    //    //magnetometer at ultra high power and 40 Hz
    //    ret = lsm9ds1_mag_data_rate_set(&lsm9ds1_mag, LSM9DS1_MAG_UHP_155Hz);

    //    //blink the blue LED
    //    nrf_gpio_pin_toggle(BLE_33_BLUE_LED);
    //    nrf_delay_ms(25);
    //    nrf_gpio_pin_toggle(BLE_33_BLUE_LED);
    //}
    //current_sensor_mode++;
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    // Initialize timer module.
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create a non-ble timer to help keep track of LED on time
    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    timer_cfg.frequency = NRF_TIMER_FREQ_16MHz;
    timer_cfg.bit_width = NRF_TIMER_BIT_WIDTH_32;

    err_code = nrf_drv_timer_init(&LED_ON_TIMER, &timer_cfg, led_on_timer_handler);
    APP_ERROR_CHECK(err_code);

    uint32_t led_on_time = nrf_drv_timer_ms_to_ticks(&LED_ON_TIMER, 2); //the LEDs will only be on for 2 milliseconds while blinking
    nrf_drv_timer_extended_compare(&LED_ON_TIMER, NRF_TIMER_CC_CHANNEL0, led_on_time, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true); //calls the led_on_timer_handler

    // Create custom timers.
    app_timer_create(&m_data_reading_timer, APP_TIMER_MODE_REPEATED, data_reading_timer_handler);
    app_timer_create(&m_led_timer, APP_TIMER_MODE_REPEATED, led_timer_handler);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    /* YOUR_JOB: Use an appearance value matching the application's use case.
       err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_);
       APP_ERROR_CHECK(err_code); */

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = SENSOR_IDLE_MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = SENSOR_IDLE_MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = SENSOR_IDLE_CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

//Functions for updating sensor power modes and settings
static void sensor_idle_mode_start()
{
    
    //In this mode, the TWI bus is active and power is going to the LSM9DS1 but the 
    //sensor is put into sleep mode. A red LED blinking in time with the connection 
    //interval shows when this mode is active.
    if (current_operating_mode == SENSOR_IDLE_MODE) return; //no need to change anything if already in idle mode

    active_led = BLE_33_RED_LED; //swap to the red LED
    ret_code_t err_code;

    if (current_operating_mode == SENSOR_ACTIVE_MODE)
    {
        //If we're transitioning from active to idle mode we need to stop the data collection timer
        //and then put the sensor into sleep mode. Once this is done we change the connection interval 
        //back to 2 seconds as we won't be communicating with the central as often (for a short while).
        err_code = app_timer_stop(m_data_reading_timer); //Even if the timer isn't actively on it's ok to call this method
        lsm9ds1_sleep_mode_enable();

        //the connection interval should be less than 2 seconds, but still check to make sure
        if (current_connection_interval < SENSOR_IDLE_MIN_CONN_INTERVAL)
        {
            ret_code_t err_code = BLE_ERROR_INVALID_CONN_HANDLE;
            ble_gap_conn_params_t new_params;

            new_params.min_conn_interval = SENSOR_IDLE_MIN_CONN_INTERVAL;
            new_params.max_conn_interval = SENSOR_IDLE_MAX_CONN_INTERVAL;
            new_params.slave_latency = SLAVE_LATENCY;
            new_params.conn_sup_timeout = SENSOR_IDLE_CONN_SUP_TIMEOUT;

            err_code = ble_conn_params_change_conn_params(m_conn_handle, &new_params);

            if (err_code != NRF_SUCCESS)
            {
                SEGGER_RTT_WriteString(0, "Couldn't update connection interval.\n");
            }
        }

        //the LED is deactivated during data collection so turn the LED back on
        err_code = app_timer_start(m_led_timer, LED_DELAY, NULL); //Even if the timer is already on it's ok to call this method
    }
    else 
    {
        //If we aren't in sensor active or idle mode, it means that we arrived here from connection mode.
        //This means that both the TWI bus and LSM9DS1 need to be turned on. No need to put the LSM9DS1 
        //into sleep mode as this happens automatically upon power up.

        // Leave the below two lines commented for future reference
        //uint32_t enabled = m_twi.u.twim.p_twim->ENABLE;
        //if (enabled == 0) nrf_drv_twi_enable(&m_twi);

        //turn on the TWI bus
        nrf_drv_twi_enable(&m_twi);

        //Power the sensor and the pullup resistors to the SCL and SDA line
        nrf_gpio_pin_set(BLE_33_SENSOR_POWER_PIN);
        nrf_gpio_pin_set(BLE_33_PULLUP);
    }

