rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
    current_operating_mode = SENSOR_IDLE_MODE; //set the current operating mode to idle
}

static void sensor_active_mode_start()
{
    if (current_operating_mode != SENSOR_IDLE_MODE) return; //we can only go to active mode from idle mode

    //All of the settings for the sensor should have been set already, we just need to activate them
    //and then start the data collection timer. We also disable the LED to save on power
    app_timer_stop(m_led_timer); //disable the led by turning of it's timer

    //TODO: For now just enable the acc,gyr and mag in normal operating mode to demonstrate mode switching
    int32_t ret = 0;
    ret = lsm9ds1_imu_data_rate_set(&lsm9ds1_imu, LSM9DS1_IMU_119Hz);
    ret = lsm9ds1_mag_data_rate_set(&lsm9ds1_mag, LSM9DS1_MAG_MP_80Hz);

    //After turning on the sensor, request that the connection interval be changed
    //to match the ODR of the sensor x the number of samples being collected.
    //TODO: Will need to get the ODR from some variable, not just write it in
    int minimum_interval_required = 1000.0 / 119.0 * SENSOR_SAMPLES + 1;
    minimum_interval_required += (15 - minimum_interval_required % 15); //round up to the nearest 15th millisecond

    //Convert from milliseconds to 1.25 millisecond units by dividing by 1.25 (same multiplying by 4/5)
    minimum_interval_required /= 5;
    minimum_interval_required *= 4;

    //Now make the connection interval change request
    ret_code_t err_code = BLE_ERROR_INVALID_CONN_HANDLE;
    ble_gap_conn_params_t new_params;

    new_params.min_conn_interval = minimum_interval_required;
    new_params.max_conn_interval = minimum_interval_required + 12; //must be 12 1.25ms units greater at a minimum
    new_params.slave_latency = SLAVE_LATENCY;
    new_params.conn_sup_timeout = SENSOR_ACTIVE_CONN_SUP_TIMEOUT;

    err_code = ble_conn_params_change_conn_params(m_conn_handle, &new_params);

    if (err_code != NRF_SUCCESS)
    {
        SEGGER_RTT_WriteString(0, "Couldn't update connection interval.\n");
    }

    //Once the settings have been applied, restart the data collection timer
    app_timer_start(m_data_reading_timer, NEXT_MEASUREMENT_DELAY, NULL); //TODO: base timeout clicks on the new connection interval

    current_operating_mode = SENSOR_ACTIVE_MODE; //set the current operating mode to idle
}

static void connected_mode_start()
{
    //We'll other be put into this mode from advertising mode (in which case all we need to do is 
    //change the color of the blinking LED, or from sensor_idle mode, in which case we need to 
    //disable the power going to the sensor and the TWI bus.
    if (current_operating_mode == SENSOR_IDLE_MODE)
    {
        //The chip is currently in sensor idle mode so we need to power off the sensor and disable the TWI bus
        //Disable power to the sensor and the pullup resistors to the SCL and SDA line
        nrf_gpio_pin_clear(BLE_33_SENSOR_POWER_PIN);
        nrf_gpio_pin_clear(BLE_33_PULLUP);

        //Turn off the TWI bus
        nrf_drv_twi_disable(&m_twi);
    }

    //change the color of the blinking LED
    active_led = BLE_33_DARK_GREEN_LED; //swap to the red LED
    current_operating_mode = CONNECTED_MODE; //set the current operating mode to idle
}

static void advertising_mode_start()
{
    //There are two ways to get into advertising mode, either by turning the device on,
    //or by losing a connection to a central device (whether this is intentional or 
    //accidental). In the latter case, we need to disable any sensors or peripherals
    //to save on power.

    switch (current_operating_mode)
    {
        case ADVERTISING_MODE:
            return; //no changes need to be made so leave the method
        case SENSOR_ACTIVE_MODE:
            sensor_idle_mode_start();
            //break statement purposely omitted here
        case SENSOR_IDLE_MODE:
            connected_mode_start();
            //break statement purposely omitted here
        default:
            active_led = BLE_33_BLUE_LED;
            break;
    }

    current_operating_mode = ADVERTISING_MODE; //set the current operating mode to idle
    
    //finally, we need to terminate the existing connection
    //TODO: Implement this feature
}

/**@brief Function for handling write events to the Sensor Settings Characteristic.
 *
 * @param[in] p_lbs     Instance of Sensor Settings Service to which the write applies.
 * @param[in] led_state Written/desired state for the sensor settings.
 */
static void LSM9DS1_settings_write_handler(uint16_t conn_handle, ble_sensor_service_t * p_ss, const uint8_t* settings_state)
{
    //Different things can happen depending on what gets written to the settings characteristic
    switch (*settings_state)
    {
        case 0:
            advertising_mode_start();
            break;
        case 1:
            connected_mode_start();
            break;
        case 2:
            sensor_idle_mode_start();
            break;
        case 3:
            sensor_idle_mode_start();
            for (int i = 1; i < 20; i++) sensor_settings[i] = *(settings_state + i);
            break;
        case 4:
            sensor_idle_mode_start();
            sensor_settings[*(settings_state + 1)] = *(settings_state + 2);
            break;
        case 5:
            sensor_active_mode_start();
            break;
    }

    //SEGGER_RTT_printf(0, "Byte %u = 0x%x\n", i, *(settings_state + i));
    
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    ret_code_t                err_code;
    nrf_ble_qwr_init_t        qwr_init = {0};
    ble_sensor_service_init_t init  = {0};

    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    // Initialize sensor service
    init.setting_write_handler = LSM9DS1_settings_write_handler;

    err_code = ble_sensor_service_init(&m_ss, &init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    ret_code_t err_code;

